src/test/org/owasp/saml/documents/file1.xml

<?xml version="1.0" encoding="UTF-8"?><soape:Envelope xmlns:soape="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soape:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soape:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-2A66FBEDF2F5EA95CA13809224774885"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soape xsd xsi"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-2A66FBEDF2F5EA95CA13809224774714"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd xsi"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>4WW/glKsuN3+gUPGVzf1oiq3tSo=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Q9rLZU/059kmu2uwtqCnwIYOvI7yrtzfHQdit4C26mDouwKoOEMHrDuQ6oRMM2n3VzznZmeSlllspT06KOx+s87btoFYnPhwf1nKWQAOxJAWcgXag9D5swumxGBBA526gJUFAATpMRhyX4dspQW2/uIE2xiCXhHzHSsxoCCZfb1YfIiq1/FH7/g/olXC5CQyK+pdXg3faFyyrzjmbXSIo+VkSmYkTxlCRUknx/CyE+C2vcrHiAEnqFPtV/8UQa6RgV24jzQEaD2/xKyjcQdbhGn/OZv4ZJ3b6nL+EpkSV+1SU/BeGd6gGtriBbfjEGrVdD63DZZDqpROIO06QfCWfw==</ds:SignatureValue><ds:KeyInfo Id="KI-2A66FBEDF2F5EA95CA13809224774612"><wsse:SecurityTokenReference wsu:Id="STR-2A66FBEDF2F5EA95CA13809224774643"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=XmlDigSig,OU=Unknown,O=Unknown,L=Unknown,ST=Unknown,C=UK</ds:X509IssuerName><ds:X509SerialNumber>1069117629</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soape:Header>
<soape:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-2A66FBEDF2F5EA95CA13809224774714">
<saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xs="http://www.w3.org/2001/XMLSchema" ID="b07b804c-7c29-ea16-7300-4f3d6f7928ac" IssueInstant="2013-12-05T09:22:05" Version="2.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
</soape:Body>
</soape:Envelope>